import type { 气运数据 } from '../types';

export const 怠惰降维: 气运数据[] = [
    { 名称: '真·微信步数修仙', 类别: '怠惰降维', 描述: '一步加一点修为，路痴属性拉满即可轻松飞升。', 效果: [{ 类型: '描述效果', 描述: '走路升级' }], 稀有度: '传说', 能力类型: '辅助', 适用境界: [10, 99], 时代适配: ['古代']},
    { 名称: '真·摸鱼光环', 类别: '怠惰降维', 描述: '十米内散发怠惰气息，敌人瞬间人间不值得。', 效果: [{ 类型: '描述效果', 描述: '摸鱼领域' }], 稀有度: '传说', 能力类型: '辅助', 适用境界: [10, 99], 时代适配: ['古代']},
    { 名称: '真·防沉迷系统', 类别: '怠惰降维', 描述: '敌人每日仅能对你造成1.5小时伤害。', 效果: [{ 类型: '描述效果', 描述: '防沉迷保护' }], 稀有度: '传说', 能力类型: '生存', 适用境界: [10, 99], 时代适配: ['古代']},
    { 名称: '真·强制休假', 类别: '怠惰降维', 描述: '扔沙滩椅给敌人，法则强迫其带薪休假三个月。', 效果: [{ 类型: '描述效果', 描述: '强制休假' }], 稀有度: '传说', 能力类型: '辅助', 适用境界: [10, 99], 时代适配: ['古代']},
    { 名称: '真·薛定谔的秘籍', 类别: '怠惰降维', 描述: '废纸处于神功/擦屁股纸叠加态，坚信是神器即可发挥神威。', 效果: [{ 类型: '描述效果', 描述: '秘叠加态' }], 稀有度: '传说', 能力类型: '特殊', 适用境界: [10, 99], 时代适配: ['古代']},
    { 名称: '真·按键精灵', 类别: '怠惰降维', 描述: '录制战斗/炼丹宏，睡着也能自动完美执行。', 效果: [{ 类型: '描述效果', 描述: '自动宏' }], 稀有度: '传说', 能力类型: '辅助', 适用境界: [10, 99], 时代适配: ['古代']}
];
